package com.ahmed.a.habib.werdapp.features.splash

import com.ahmed.a.habib.werdapp.utils.getRandom


class LauncherModel {

    fun getText() = when (getRandom(1, 5)) {
        1 -> {
            "يا أيها الذين آمنوا اذكروا الله ذكرا كثيرا * وسبحوه بكرة وأصيلا."
        }

        2 -> {
            "قال النبي صل الله عليه وسلم : ألا أنبئكم بخير أعمالكم وأرضاها عند مليككم، وأرفعها في درجاتكم قيل ما هي يا رسول الله فقال : لا يزال لسانك رطب بذكر الله."
        }

        3 -> {
            "الذين آمنوا وتطمئن قلوبهم بذكر الله ۗ ألا بذكر الله تطمئن القلوب."
        }

        4 -> {
            "خير الأعمال الي الله أدومها وإن قل."
        }

        5 -> {
            "ما لا يدرك كله لا يترك جله فاجعل لك وِرْدا."
        }

        else -> {
            "اللهم أغفر لي و للمؤمنين."
        }
    }
}